src/Catalogs/Показатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Показатели</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УсловноеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленоЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТипЗначенияПоказателя</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаИерархии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаИерархии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоследнееЗначениеДляПоследнегоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловноеОформление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеОт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЗначенияПоказателя</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДо</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипЗначенияПоказателя</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбщегоНазначенияСервер/Ext/Module.bsl
Функция РассчитатьЗначениеПоказателя(ЗначенияПоказателей, Показатель, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Результат = ЗначениеПоУмолчанию;
	
	Если 1=2 Тогда
		Показатель = Справочники.Показатели.ПустаяСсылка();
	КонецЕсли; 
	
	Формула = Показатель.ФормулаРасчета;
	
	Если ПустаяСтрока(Формула) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ВычислитьЗначениеПоФормуле(ЗначенияПоказателей, Показатель, Формула, ЗначениеПоУмолчанию);
	
КонецФункции

Функция ПроверитьЗначениеПоказателя(ЗначенияПоказателей, Показатель, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = ЗначениеПоУмолчанию;
	
	Если 1=2 Тогда
		Показатель = Справочники.Показатели.ПустаяСсылка();
	КонецЕсли; 
	
	Формула = Показатель.ФормулаПроверки;
	
	Если ПустаяСтрока(Формула) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ВычислитьЗначениеПоФормуле(ЗначенияПоказателей, Показатель, Формула, ЗначениеПоУмолчанию);
	
КонецФункции

Функция ВычислитьЗначениеПоФормуле(ЗначенияПоказателей, Показатель, Формула, ЗначениеПоУмолчанию = Неопределено)
	
	Значения = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ЗначенияПоказателей Цикл
		
		ТекПоказатель = КлючИЗначение.Ключ;
		ТекЗнач = КлючИЗначение.Значение;
		ТекУслОбозн = ?(ТипЗнч(ТекПоказатель) = Тип("СправочникСсылка.Показатели"), 
					    ТекПоказатель.УсловноеОбозначение,
						ТекПоказатель);

		Значения.Вставить(ТекУслОбозн, ТекЗнач);
		
	КонецЦикла; 
	
	ИспользумыеУсловныеОбозначения = Новый Массив; 
	Стр = Формула;
	
	НачПоз = Найти(Стр, "[");
	ТекПоз = НачПоз;
	Пока НачПоз > 0 Цикл
		
		НачалоСообщенияОбОшибке = "Ошибка расчета показателя """ + Показатель + """! Ошибка в формуле """ + Формула + """. Поз. #" + ТекПоз + ": ";
		
		КонПоз = Найти(Стр, "]");
		Если КонПоз = 0 
			Или КонПоз <= НачПоз Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НачалоСообщенияОбОшибке + "Проверьте правильность указания символов ""["" и ""]""!");
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли; 
		
		ТекУслОбозн = Сред(Стр, НачПоз + 1, КонПоз - НачПоз - 1);
		
		Если ПустаяСтрока(ТекУслОбозн) Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НачалоСообщенияОбОшибке + "Не задано наименование показателя!");
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли; 
		
		Если Значения.Получить(ТекУслОбозн) = Неопределено Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НачалоСообщенияОбОшибке + "Показатель """ + ТекУслОбозн + """ не найден!");
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли; 
		
		ТекУслОбозн = СтрЗаменить(ТекУслОбозн, """", """""");
		
		Если ИспользумыеУсловныеОбозначения.Найти(ТекУслОбозн) = Неопределено Тогда
			ИспользумыеУсловныеОбозначения.Добавить(ТекУслОбозн);
		КонецЕсли; 
		
		Стр = Сред(Стр, КонПоз + 1);
		ТекПоз = ТекПоз + КонПоз + 1 - НачПоз;
		
		НачПоз = Найти(Стр, "[");
		ТекПоз = ТекПоз + НачПоз - 1;
		
	КонецЦикла; 
	
	НачалоСообщенияОбОшибке = "Ошибка расчета показателя """ + Показатель + """ по формуле """ + Формула + """! ";
	
	ФормулаДляВычисления = Формула;
	
	Для Каждого ТекУслОбозн Из ИспользумыеУсловныеОбозначения Цикл
		
		Если Значения.Получить(ТекУслОбозн) = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НачалоСообщенияОбОшибке + "Значение показателя """ + ТекУслОбозн + """ не установлено!");
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли; 
		
		ФормулаДляВычисления = СтрЗаменить(ФормулаДляВычисления, 
			"[" + ТекУслОбозн + "]",
			"Значения.Получить(""" + ТекУслОбозн + """)");
			
	КонецЦикла; 
	
	УстановитьБезопасныйРежим(Истина);
	Попытка
		Результат = Вычислить(ФормулаДляВычисления);
	Исключение
		Результат = ЗначениеПоУмолчанию;
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НачалоСообщенияОбОшибке
			+ "Техн.информация: Формула для вычисления = """ + ФормулаДляВычисления + ". Описание ошибки = " + ОписаниеОшибки());
	КонецПопытки; 
	УстановитьБезопасныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции
